// 1. Напишите функцию, которая принимает два числовых аргумента и возвращает наименьшее из них.

// function num(a, b) {
//   if (a < b) {
//     return a
//   } else {
//       return b
//     }
// }
  
// let minNum = num(3, 4)
// console.log(minNum);


// 2. Напишите функцию, которая принимает два числовых аргумента
// и выводит в консоль все четные числа от большего к меньшему.

  
// function num1(a, b) {
//   if (a % 2 === 0) {
//     console.log(a);
//   }
//   if (b % 2 === 0) {
//     console.log(b)
//   }
  
//   let min = a
//   let max = b
//   if (a > b) {
//     min = b
//     max = a
//   }

//   for (let i = max; i >= min; i--) {
//     num1.push(i)
//   }
//   console.log(num1);
// }

// 3. Напишите функцию power, которая принимает два числовых аргумента
// (основание степени и саму степень) и возвращает число в указанной степени.
//  Значение степени должно быть указано по умолчанию 2.

// function power(a, b = 2) {
//   console.log(a**b)
// }

// power(3)

// 4. Напишите функцию, которая принимает числовой аргумент n и считает сумму чисел от 1 до n.


// function num2(a, b, c, n) {
//   let numSum = 0
//   for (let i = 0; i < num2.length; i++) {
//     numSum += num2[i];
//   }
  
//   return num2
// }

// let result = num2(1, 2, 3, 4)
// console.log(result);

// 5. Напишите функцию, которая принимает два числовых аргумента n и m и считает сумму
// четных чисел и нечетных чисел от n до m.Суммы выведите
// в консоль(в начале сумму четных чисел, а затем сумму нечетных).

// function num3(n, m) {
//   let evenSum = 0
//   let oddSum = 0

//   for(let i = 0; i < num3.length; i++) {
//   if (n % 2 === 0) {
//     evenSum += n
//   } else if (m % 2 === 0) {
//     oddSum += m
//   }
// }

//   console.log(evenSum);
//   console.log(oddSum);
// }

// 6. Напишите функцию, которая принимает в качестве аргументов массив строк,
// а возвращает первый самый длинный элемент массива.Если входной массив пуст,
// функция возвращает null.Если есть несколько одинаковых по длине элементов -
// функция возвращает первый из этих элементов.
// Пример: [ 'one', 'two', 'three' ] => 'three'

// function isArray(arr) {
//   for(let i = word.length - 1; i >= 0; i--) {
    
//   }
// }

// console.log(arr(["one", 'two', 'three', 'four', 'five' ]));